[Killed] ArithmeticOperator
src/services/revenueRules.js:1:49
-export const roundMoney = (value) => Math.round(Number(value) * 100) / 100;
+export const roundMoney = (value) => Math.round(Number(value) / 100) / 100;
 
 export const normalizeQuantity = (value) => (
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✕ rounds money to cents (29 ms)

    ✕ rounds money to cents (1 ms)

[Killed] ArithmeticOperator
src/services/revenueRules.js:1:38
-export const roundMoney = (value) => Math.round(Number(value) * 100) / 100;
+export const roundMoney = (value) => Math.round(Number(value) * 100) * 100;
 
 export const normalizeQuantity = (value) => (
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✕ rounds money to cents (28 ms)

    ✕ rounds money to cents (4 ms)
    ✓ rounds money to cents (1 ms)

[Killed] EqualityOperator
src/services/revenueRules.js:4:30
 export const roundMoney = (value) => Math.round(Number(value) * 100) / 100;
 
 export const normalizeQuantity = (value) => (
-  Number.isInteger(value) && value > 0 ? value : 1
+  Number.isInteger(value) && value <= 0 ? value : 1
 );
 
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✓ rounds money to cents (29 ms)

    ✓ rounds money to cents (1 ms)
    ✓ rounds money to cents (1 ms)

[Killed] EqualityOperator
src/services/revenueRules.js:4:30
 export const roundMoney = (value) => Math.round(Number(value) * 100) / 100;
 
 export const normalizeQuantity = (value) => (
-  Number.isInteger(value) && value > 0 ? value : 1
+  Number.isInteger(value) && value >= 0 ? value : 1
 );
 
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✓ rounds money to cents (25 ms)

    ✓ rounds money to cents (2 ms)
    ✓ rounds money to cents (1 ms)

[Killed] LogicalOperator
src/services/revenueRules.js:9:17
 
 export const calculateBuyerLine = (breakdown, quantity = 1) => {
   const qty = normalizeQuantity(quantity);
-  const buyer = breakdown?.buyer || {};
+  const buyer = breakdown?.buyer && {};
   const itemPrice = Number(buyer.itemPrice) || 0;
   const shippingCost = Number(buyer.shippingCost) || 0;
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✓ rounds money to cents (24 ms)

    ✓ rounds money to cents (1 ms)
    ✓ rounds money to cents (1 ms)

[Killed] OptionalChaining
src/services/revenueRules.js:9:17
 
 export const calculateBuyerLine = (breakdown, quantity = 1) => {
   const qty = normalizeQuantity(quantity);
-  const buyer = breakdown?.buyer || {};
+  const buyer = breakdown.buyer || {};
   const itemPrice = Number(buyer.itemPrice) || 0;
   const shippingCost = Number(buyer.shippingCost) || 0;
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✓ rounds money to cents (25 ms)

    ✓ rounds money to cents (2 ms)
    ✓ rounds money to cents (1 ms)

[Killed] LogicalOperator
src/services/revenueRules.js:10:21
 export const calculateBuyerLine = (breakdown, quantity = 1) => {
   const qty = normalizeQuantity(quantity);
   const buyer = breakdown?.buyer || {};
-  const itemPrice = Number(buyer.itemPrice) || 0;
+  const itemPrice = Number(buyer.itemPrice) && 0;
   const shippingCost = Number(buyer.shippingCost) || 0;
   const protectionFee = Number(buyer.buyerProtectionFee) || 0;
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✓ rounds money to cents (24 ms)

    ✓ rounds money to cents (1 ms)
    ✓ rounds money to cents (1 ms)

[Killed] LogicalOperator
src/services/revenueRules.js:11:24
   const qty = normalizeQuantity(quantity);
   const buyer = breakdown?.buyer || {};
   const itemPrice = Number(buyer.itemPrice) || 0;
-  const shippingCost = Number(buyer.shippingCost) || 0;
+  const shippingCost = Number(buyer.shippingCost) && 0;
   const protectionFee = Number(buyer.buyerProtectionFee) || 0;
   return {
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✓ rounds money to cents (24 ms)

    ✓ rounds money to cents (1 ms)
    ✓ rounds money to cents (1 ms)

[Killed] LogicalOperator
src/services/revenueRules.js:12:25
   const buyer = breakdown?.buyer || {};
   const itemPrice = Number(buyer.itemPrice) || 0;
   const shippingCost = Number(buyer.shippingCost) || 0;
-  const protectionFee = Number(buyer.buyerProtectionFee) || 0;
+  const protectionFee = Number(buyer.buyerProtectionFee) && 0;
   return {
     itemPrice: itemPrice * qty,
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✓ rounds money to cents (24 ms)

    ✓ rounds money to cents (1 ms)
    ✓ rounds money to cents (1 ms)

[Killed] ArithmeticOperator
src/services/revenueRules.js:14:16
   const shippingCost = Number(buyer.shippingCost) || 0;
   const protectionFee = Number(buyer.buyerProtectionFee) || 0;
   return {
-    itemPrice: itemPrice * qty,
+    itemPrice: itemPrice / qty,
     shippingCost,
     protectionFee: protectionFee * qty,
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✓ rounds money to cents (24 ms)

    ✓ rounds money to cents (1 ms)
    ✓ rounds money to cents (1 ms)

[Killed] ArithmeticOperator
src/services/revenueRules.js:16:20
   return {
     itemPrice: itemPrice * qty,
     shippingCost,
-    protectionFee: protectionFee * qty,
+    protectionFee: protectionFee / qty,
     total: roundMoney(itemPrice * qty + shippingCost + protectionFee * qty),
   };
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✓ rounds money to cents (24 ms)

    ✓ rounds money to cents (2 ms)
    ✓ rounds money to cents (1 ms)

[Killed] ArithmeticOperator
src/services/revenueRules.js:17:23
     itemPrice: itemPrice * qty,
     shippingCost,
     protectionFee: protectionFee * qty,
-    total: roundMoney(itemPrice * qty + shippingCost + protectionFee * qty),
+    total: roundMoney(itemPrice / qty + shippingCost + protectionFee * qty),
   };
 };
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✓ rounds money to cents (24 ms)

    ✓ rounds money to cents (2 ms)
    ✓ rounds money to cents (1 ms)

[Killed] ArithmeticOperator
src/services/revenueRules.js:17:23
     itemPrice: itemPrice * qty,
     shippingCost,
     protectionFee: protectionFee * qty,
-    total: roundMoney(itemPrice * qty + shippingCost + protectionFee * qty),
+    total: roundMoney(itemPrice * qty + shippingCost - protectionFee * qty),
   };
 };
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✓ rounds money to cents (24 ms)

    ✓ rounds money to cents (1 ms)
    ✓ rounds money to cents (1 ms)

[Killed] ArithmeticOperator
src/services/revenueRules.js:22:26
 };
 
 export const calculateSellerNet = (itemPrice, platformFee, boostFee = 0) => (
-  roundMoney(Math.max(0, Number(itemPrice) - Number(platformFee) - Number(boostFee)))
+  roundMoney(Math.max(0, Number(itemPrice) - Number(platformFee) + Number(boostFee)))
 );
 
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✓ rounds money to cents (50 ms)

    ✓ rounds money to cents (2 ms)
    ✓ rounds money to cents (1 ms)

[Killed] ArithmeticOperator
src/services/revenueRules.js:22:26
 };
 
 export const calculateSellerNet = (itemPrice, platformFee, boostFee = 0) => (
-  roundMoney(Math.max(0, Number(itemPrice) - Number(platformFee) - Number(boostFee)))
+  roundMoney(Math.max(0, Number(itemPrice) + Number(platformFee) - Number(boostFee)))
 );
 
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✓ rounds money to cents (25 ms)

    ✓ rounds money to cents (2 ms)
    ✓ rounds money to cents (1 ms)

[Killed] ArithmeticOperator
src/services/revenueRules.js:26:26
 );
 
 export const calculateBuyerTotal = (itemPrice, shippingCost, protectionFee, discount = 0) => (
-  roundMoney(Math.max(0, Number(itemPrice) + Number(shippingCost) + Number(protectionFee) - Number(discount)))
+  roundMoney(Math.max(0, Number(itemPrice) - Number(shippingCost) + Number(protectionFee) - Number(discount)))
 );
 
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✓ rounds money to cents (37 ms)

    ✓ rounds money to cents (1 ms)
    ✓ rounds money to cents (2 ms)

[Killed] ArithmeticOperator
src/services/revenueRules.js:26:26
 );
 
 export const calculateBuyerTotal = (itemPrice, shippingCost, protectionFee, discount = 0) => (
-  roundMoney(Math.max(0, Number(itemPrice) + Number(shippingCost) + Number(protectionFee) - Number(discount)))
+  roundMoney(Math.max(0, Number(itemPrice) + Number(shippingCost) + Number(protectionFee) + Number(discount)))
 );
 
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✓ rounds money to cents (26 ms)

    ✓ rounds money to cents (1 ms)
    ✓ rounds money to cents (1 ms)

[Killed] ArithmeticOperator
src/services/revenueRules.js:30:14
 );
 
 export const calculatePlatformNet = (platformFee, protectionFee, providerFee) => (
-  roundMoney(Number(platformFee) + Number(protectionFee) - Number(providerFee))
+  roundMoney(Number(platformFee) - Number(protectionFee) - Number(providerFee))
 );
 
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✓ rounds money to cents (28 ms)

    ✓ rounds money to cents (2 ms)
    ✓ rounds money to cents (1 ms)

[Killed] ArithmeticOperator
src/services/revenueRules.js:30:14
 );
 
 export const calculatePlatformNet = (platformFee, protectionFee, providerFee) => (
-  roundMoney(Number(platformFee) + Number(protectionFee) - Number(providerFee))
+  roundMoney(Number(platformFee) + Number(protectionFee) + Number(providerFee))
 );
 
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✓ rounds money to cents (25 ms)

    ✓ rounds money to cents (1 ms)
    ✓ rounds money to cents (1 ms)

[Killed] ArithmeticOperator
src/services/revenueRules.js:64:53
 });
 
 export const calculateDiscountedSellerNet = (itemPrice, platformFeePercent, discount = 0) => {
-  const discountedSubtotal = roundMoney(Math.max(0, Number(itemPrice) - Number(discount)));
+  const discountedSubtotal = roundMoney(Math.max(0, Number(itemPrice) + Number(discount)));
   const platformFee = roundMoney(discountedSubtotal * (Number(platformFeePercent) / 100));
   return {
killedBy: All tests
statusReason: FAIL src/services/revenueRules.test.js

  client revenue rules

    ✓ rounds money to cents (26 ms)

    ✓ rounds money to cents (2 ms)
