[Killed] ArithmeticOperator
criticalRules.js:1:42
-const roundMoney = (value) => Math.round(Number(value) * 100) / 100;
+const roundMoney = (value) => Math.round(Number(value) / 100) / 100;
 
 const calculateSellerNet = (itemPrice, platformFee, boostFee = 0) =>
killedBy: revenue invariants — customer, seller, and platform rounds every ledger leg to cents
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10.01
Received: 0

[Killed] ArithmeticOperator
criticalRules.js:1:31
-const roundMoney = (value) => Math.round(Number(value) * 100) / 100;
+const roundMoney = (value) => Math.round(Number(value) * 100) * 100;
 
 const calculateSellerNet = (itemPrice, platformFee, boostFee = 0) =>
killedBy: revenue invariants — customer, seller, and platform rounds every ledger leg to cents
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10.01
Received: 100100

[Killed] ArithmeticOperator
criticalRules.js:4:26
 const roundMoney = (value) => Math.round(Number(value) * 100) / 100;
 
 const calculateSellerNet = (itemPrice, platformFee, boostFee = 0) =>
-  roundMoney(Math.max(0, Number(itemPrice) - Number(platformFee) - Number(boostFee)));
+  roundMoney(Math.max(0, Number(itemPrice) - Number(platformFee) + Number(boostFee)));
 
 const calculateBuyerTotal = (itemPrice, shippingCost, buyerProtectionFee, discount = 0) =>
killedBy: revenue invariants — customer, seller, and platform seller net never includes shipping or buyer protection
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 89
Received: 95

[Killed] ArithmeticOperator
criticalRules.js:4:26
 const roundMoney = (value) => Math.round(Number(value) * 100) / 100;
 
 const calculateSellerNet = (itemPrice, platformFee, boostFee = 0) =>
-  roundMoney(Math.max(0, Number(itemPrice) - Number(platformFee) - Number(boostFee)));
+  roundMoney(Math.max(0, Number(itemPrice) + Number(platformFee) - Number(boostFee)));
 
 const calculateBuyerTotal = (itemPrice, shippingCost, buyerProtectionFee, discount = 0) =>
killedBy: revenue invariants — customer, seller, and platform seller net never includes shipping or buyer protection
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 89
Received: 105

[Killed] ArithmeticOperator
criticalRules.js:7:26
   roundMoney(Math.max(0, Number(itemPrice) - Number(platformFee) - Number(boostFee)));
 
 const calculateBuyerTotal = (itemPrice, shippingCost, buyerProtectionFee, discount = 0) =>
-  roundMoney(Math.max(0, Number(itemPrice) + Number(shippingCost) + Number(buyerProtectionFee) - Number(discount)));
+  roundMoney(Math.max(0, Number(itemPrice) + Number(shippingCost) + Number(buyerProtectionFee) + Number(discount)));
 
 const calculatePlatformNet = (platformFee, buyerProtectionFee, providerFee) =>
killedBy: revenue invariants — customer, seller, and platform customer charge includes item, one shipping charge, protection, and discount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 107
Received: 127

[Killed] ArithmeticOperator
criticalRules.js:7:26
   roundMoney(Math.max(0, Number(itemPrice) - Number(platformFee) - Number(boostFee)));
 
 const calculateBuyerTotal = (itemPrice, shippingCost, buyerProtectionFee, discount = 0) =>
-  roundMoney(Math.max(0, Number(itemPrice) + Number(shippingCost) + Number(buyerProtectionFee) - Number(discount)));
+  roundMoney(Math.max(0, Number(itemPrice) + Number(shippingCost) - Number(buyerProtectionFee) - Number(discount)));
 
 const calculatePlatformNet = (platformFee, buyerProtectionFee, providerFee) =>
killedBy: revenue invariants — customer, seller, and platform customer charge includes item, one shipping charge, protection, and discount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 107
Received: 97

[Killed] ArithmeticOperator
criticalRules.js:10:14
   roundMoney(Math.max(0, Number(itemPrice) + Number(shippingCost) + Number(buyerProtectionFee) - Number(discount)));
 
 const calculatePlatformNet = (platformFee, buyerProtectionFee, providerFee) =>
-  roundMoney(Number(platformFee) + Number(buyerProtectionFee) - Number(providerFee));
+  roundMoney(Number(platformFee) + Number(buyerProtectionFee) + Number(providerFee));
 
 const allocateDiscountedSellerNet = (itemPrice, platformFeePercent, discount = 0) => {
killedBy: revenue invariants — customer, seller, and platform platform net is gross fees minus provider fee, never seller funds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9.31
Received: 16.69

[Killed] ArithmeticOperator
criticalRules.js:10:14
   roundMoney(Math.max(0, Number(itemPrice) + Number(shippingCost) + Number(buyerProtectionFee) - Number(discount)));
 
 const calculatePlatformNet = (platformFee, buyerProtectionFee, providerFee) =>
-  roundMoney(Number(platformFee) + Number(buyerProtectionFee) - Number(providerFee));
+  roundMoney(Number(platformFee) - Number(buyerProtectionFee) - Number(providerFee));
 
 const allocateDiscountedSellerNet = (itemPrice, platformFeePercent, discount = 0) => {
killedBy: revenue invariants — customer, seller, and platform platform net is gross fees minus provider fee, never seller funds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9.31
Received: -0.69

[Killed] ArithmeticOperator
criticalRules.js:13:53
   roundMoney(Number(platformFee) + Number(buyerProtectionFee) - Number(providerFee));
 
 const allocateDiscountedSellerNet = (itemPrice, platformFeePercent, discount = 0) => {
-  const discountedSubtotal = roundMoney(Math.max(0, Number(itemPrice) - Number(discount)));
+  const discountedSubtotal = roundMoney(Math.max(0, Number(itemPrice) + Number(discount)));
   const platformFee = roundMoney(discountedSubtotal * (Number(platformFeePercent) / 100));
   return {
killedBy: revenue invariants — customer, seller, and platform seller-funded discount cannot reduce another seller or create seller earnings
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
-   "discountedSubtotal": 90,
-   "platformFee": 7.2,

[Killed] ArithmeticOperator
criticalRules.js:14:34
 
 const allocateDiscountedSellerNet = (itemPrice, platformFeePercent, discount = 0) => {
   const discountedSubtotal = roundMoney(Math.max(0, Number(itemPrice) - Number(discount)));
-  const platformFee = roundMoney(discountedSubtotal * (Number(platformFeePercent) / 100));
+  const platformFee = roundMoney(discountedSubtotal / (Number(platformFeePercent) / 100));
   return {
     discountedSubtotal,
killedBy: revenue invariants — customer, seller, and platform seller-funded discount cannot reduce another seller or create seller earnings
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "discountedSubtotal": 90,
-   "platformFee": 7.2,

[Killed] ArithmeticOperator
criticalRules.js:14:56
 
 const allocateDiscountedSellerNet = (itemPrice, platformFeePercent, discount = 0) => {
   const discountedSubtotal = roundMoney(Math.max(0, Number(itemPrice) - Number(discount)));
-  const platformFee = roundMoney(discountedSubtotal * (Number(platformFeePercent) / 100));
+  const platformFee = roundMoney(discountedSubtotal * (Number(platformFeePercent) * 100));
   return {
     discountedSubtotal,
killedBy: revenue invariants — customer, seller, and platform seller-funded discount cannot reduce another seller or create seller earnings
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "discountedSubtotal": 90,
-   "platformFee": 7.2,

[Killed] ArithmeticOperator
criticalRules.js:31:49
   providerFee = 0,
   discount = 0,
 }) => {
-  const discountedItem = roundMoney(Math.max(0, Number(itemPrice) - Number(discount)));
+  const discountedItem = roundMoney(Math.max(0, Number(itemPrice) + Number(discount)));
   const customerCharge = calculateBuyerTotal(discountedItem, shippingCost, buyerProtectionFee);
   const sellerEarnings = calculateSellerNet(discountedItem, platformFee, boostFee);
killedBy: revenue invariants — customer, seller, and platform reconciles customer, seller, and platform legs without losing item funds
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 3

  Object {
-   "customerCharge": 107,
-   "itemLedger": 90,

[Killed] ArithmeticOperator
criticalRules.js:34:36
   const discountedItem = roundMoney(Math.max(0, Number(itemPrice) - Number(discount)));
   const customerCharge = calculateBuyerTotal(discountedItem, shippingCost, buyerProtectionFee);
   const sellerEarnings = calculateSellerNet(discountedItem, platformFee, boostFee);
-  const platformGross = roundMoney(Number(platformFee) + Number(buyerProtectionFee));
+  const platformGross = roundMoney(Number(platformFee) - Number(buyerProtectionFee));
   const platformNet = calculatePlatformNet(platformFee, buyerProtectionFee, providerFee);
   return {
killedBy: revenue invariants — customer, seller, and platform customer charge accounts for every gross leg without dropping shipping or protection
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 13
Received: 3

[Killed] ArithmeticOperator
criticalRules.js:42:28
     sellerEarnings,
     platformGross,
     platformNet,
-    itemLedger: roundMoney(sellerEarnings + Number(platformFee) + Number(boostFee)),
+    itemLedger: roundMoney(sellerEarnings - Number(platformFee) + Number(boostFee)),
   };
 };
killedBy: revenue invariants — customer, seller, and platform customer charge accounts for every gross leg without dropping shipping or protection
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 91
Received: 107

[Killed] ArithmeticOperator
criticalRules.js:42:28
     sellerEarnings,
     platformGross,
     platformNet,
-    itemLedger: roundMoney(sellerEarnings + Number(platformFee) + Number(boostFee)),
+    itemLedger: roundMoney(sellerEarnings + Number(platformFee) - Number(boostFee)),
   };
 };
killedBy: revenue invariants — customer, seller, and platform customer charge accounts for every gross leg without dropping shipping or protection
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 101
Received: 107

[Killed] EqualityOperator
criticalRules.js:49:60
 const calculateRefundSettlement = ({ totalPaid, sellerEarnings, inventoryQuantity = 1 }) => ({
   buyerRefund: roundMoney(Math.max(0, Number(totalPaid))),
   sellerClawback: roundMoney(Math.max(0, Number(sellerEarnings))),
-  restoredQuantity: Number.isInteger(inventoryQuantity) && inventoryQuantity > 0 ? inventoryQuantity : 1,
+  restoredQuantity: Number.isInteger(inventoryQuantity) && inventoryQuantity >= 0 ? inventoryQuantity : 1,
 });
 
killedBy: revenue invariants — customer, seller, and platform refund settlement returns the captured customer amount and exact seller clawback
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "buyerRefund": 0,
-   "restoredQuantity": 1,

[Killed] LogicalOperator
criticalRules.js:49:21
 const calculateRefundSettlement = ({ totalPaid, sellerEarnings, inventoryQuantity = 1 }) => ({
   buyerRefund: roundMoney(Math.max(0, Number(totalPaid))),
   sellerClawback: roundMoney(Math.max(0, Number(sellerEarnings))),
-  restoredQuantity: Number.isInteger(inventoryQuantity) && inventoryQuantity > 0 ? inventoryQuantity : 1,
+  restoredQuantity: Number.isInteger(inventoryQuantity) || inventoryQuantity > 0 ? inventoryQuantity : 1,
 });
 
killedBy: revenue invariants — customer, seller, and platform refund settlement returns the captured customer amount and exact seller clawback
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "buyerRefund": 0,
-   "restoredQuantity": 1,

[Killed] EqualityOperator
criticalRules.js:53:7
 });
 
 const isValidMoneyInput = (value, max) => {
-  if (typeof value !== 'number') return false;
+  if (typeof value === 'number') return false;
   if (!Number.isFinite(value)) return false;
   if (value < 0) return false;
killedBy: critical payment, inventory, and authorization rules payment money validation accepts finite non-negative value 0 within max
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
criticalRules.js:53:41
 });
 
 const isValidMoneyInput = (value, max) => {
-  if (typeof value !== 'number') return false;
+  if (typeof value !== 'number') return true;
   if (!Number.isFinite(value)) return false;
   if (value < 0) return false;
killedBy: critical payment, inventory, and authorization rules payment money validation rejects string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
criticalRules.js:54:7
 
 const isValidMoneyInput = (value, max) => {
   if (typeof value !== 'number') return false;
-  if (!Number.isFinite(value)) return false;
+  if (Number.isFinite(value)) return false;
   if (value < 0) return false;
   return value <= max;
killedBy: critical payment, inventory, and authorization rules payment money validation accepts finite non-negative value 0 within max
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
criticalRules.js:54:39
 
 const isValidMoneyInput = (value, max) => {
   if (typeof value !== 'number') return false;
-  if (!Number.isFinite(value)) return false;
+  if (!Number.isFinite(value)) return true;
   if (value < 0) return false;
   return value <= max;
killedBy: critical payment, inventory, and authorization rules payment money validation rejects nan
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
criticalRules.js:55:7
 const isValidMoneyInput = (value, max) => {
   if (typeof value !== 'number') return false;
   if (!Number.isFinite(value)) return false;
-  if (value < 0) return false;
+  if (value <= 0) return false;
   return value <= max;
 };
killedBy: critical payment, inventory, and authorization rules payment money validation accepts finite non-negative value 0 within max
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
criticalRules.js:55:25
 const isValidMoneyInput = (value, max) => {
   if (typeof value !== 'number') return false;
   if (!Number.isFinite(value)) return false;
-  if (value < 0) return false;
+  if (value < 0) return true;
   return value <= max;
 };
killedBy: critical payment, inventory, and authorization rules payment money validation rejects negative
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
criticalRules.js:56:10
   if (typeof value !== 'number') return false;
   if (!Number.isFinite(value)) return false;
   if (value < 0) return false;
-  return value <= max;
+  return value < max;
 };
 
killedBy: critical payment, inventory, and authorization rules payment money validation accepts finite non-negative value 100 within max
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
criticalRules.js:56:10
   if (typeof value !== 'number') return false;
   if (!Number.isFinite(value)) return false;
   if (value < 0) return false;
-  return value <= max;
+  return value > max;
 };
 
killedBy: critical payment, inventory, and authorization rules payment money validation rejects above maximum
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
criticalRules.js:60:7
 };
 
 const isPositiveIntegerQuantity = (value) => {
-  if (typeof value !== 'number') return false;
+  if (typeof value === 'number') return false;
   if (!Number.isFinite(value)) return false;
   if (!Number.isInteger(value)) return false;
killedBy: critical payment, inventory, and authorization rules payment quantity validation accepts positive integer quantity 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
criticalRules.js:60:41
 };
 
 const isPositiveIntegerQuantity = (value) => {
-  if (typeof value !== 'number') return false;
+  if (typeof value !== 'number') return true;
   if (!Number.isFinite(value)) return false;
   if (!Number.isInteger(value)) return false;
killedBy: critical payment, inventory, and authorization rules payment quantity validation rejects invalid quantity undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
criticalRules.js:62:7
 const isPositiveIntegerQuantity = (value) => {
   if (typeof value !== 'number') return false;
   if (!Number.isFinite(value)) return false;
-  if (!Number.isInteger(value)) return false;
+  if (Number.isInteger(value)) return false;
   return value >= 1;
 };
killedBy: critical payment, inventory, and authorization rules payment quantity validation rejects invalid quantity 1.5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
criticalRules.js:62:40
 const isPositiveIntegerQuantity = (value) => {
   if (typeof value !== 'number') return false;
   if (!Number.isFinite(value)) return false;
-  if (!Number.isInteger(value)) return false;
+  if (!Number.isInteger(value)) return true;
   return value >= 1;
 };
killedBy: critical payment, inventory, and authorization rules payment quantity validation rejects invalid quantity 1.5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
criticalRules.js:63:10
   if (typeof value !== 'number') return false;
   if (!Number.isFinite(value)) return false;
   if (!Number.isInteger(value)) return false;
-  return value >= 1;
+  return value > 1;
 };
 
killedBy: critical payment, inventory, and authorization rules payment quantity validation accepts positive integer quantity 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
criticalRules.js:63:10
   if (typeof value !== 'number') return false;
   if (!Number.isFinite(value)) return false;
   if (!Number.isInteger(value)) return false;
-  return value >= 1;
+  return value < 1;
 };
 
killedBy: critical payment, inventory, and authorization rules payment quantity validation rejects invalid quantity 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
criticalRules.js:67:39
 };
 
 const isValidInventoryQuantity = (value) => {
-  if (!Number.isFinite(value)) return false;
+  if (!Number.isFinite(value)) return true;
   if (value < 0) return false;
   return value <= 1000000;
killedBy: critical payment, inventory, and authorization rules inventory quantity validation rejects invalid inventory quantity null
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
criticalRules.js:67:7
 };
 
 const isValidInventoryQuantity = (value) => {
-  if (!Number.isFinite(value)) return false;
+  if (Number.isFinite(value)) return false;
   if (value < 0) return false;
   return value <= 1000000;
killedBy: critical payment, inventory, and authorization rules inventory quantity validation rejects invalid inventory quantity "4"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
criticalRules.js:68:7
 
 const isValidInventoryQuantity = (value) => {
   if (!Number.isFinite(value)) return false;
-  if (value < 0) return false;
+  if (value >= 0) return false;
   return value <= 1000000;
 };
killedBy: critical payment, inventory, and authorization rules inventory quantity validation rejects invalid inventory quantity -1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
criticalRules.js:69:10
 const isValidInventoryQuantity = (value) => {
   if (!Number.isFinite(value)) return false;
   if (value < 0) return false;
-  return value <= 1000000;
+  return value > 1000000;
 };
 
killedBy: critical payment, inventory, and authorization rules inventory quantity validation rejects invalid inventory quantity 1000001
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
criticalRules.js:69:10
 const isValidInventoryQuantity = (value) => {
   if (!Number.isFinite(value)) return false;
   if (value < 0) return false;
-  return value <= 1000000;
+  return value < 1000000;
 };
 
killedBy: critical payment, inventory, and authorization rules inventory quantity validation accepts bounded inventory quantity 1000000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
criticalRules.js:73:32
 };
 
 const isValidAutoReorderPatch = ({ enabled, quantity, supplier }) => {
-  if (enabled !== undefined && typeof enabled !== 'boolean') return false;
+  if (enabled !== undefined && typeof enabled === 'boolean') return false;
   if (quantity !== undefined) {
     if (typeof quantity !== 'number') return false;
killedBy: critical payment, inventory, and authorization rules inventory auto-reorder patch validation rejects {"enabled":"yes"}
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
criticalRules.js:73:7
 };
 
 const isValidAutoReorderPatch = ({ enabled, quantity, supplier }) => {
-  if (enabled !== undefined && typeof enabled !== 'boolean') return false;
+  if (enabled !== undefined || typeof enabled !== 'boolean') return false;
   if (quantity !== undefined) {
     if (typeof quantity !== 'number') return false;
killedBy: critical payment, inventory, and authorization rules inventory auto-reorder patch validation accepts {}
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
criticalRules.js:74:7
 
 const isValidAutoReorderPatch = ({ enabled, quantity, supplier }) => {
   if (enabled !== undefined && typeof enabled !== 'boolean') return false;
-  if (quantity !== undefined) {
+  if (quantity === undefined) {
     if (typeof quantity !== 'number') return false;
     if (!Number.isFinite(quantity)) return false;
killedBy: critical payment, inventory, and authorization rules inventory auto-reorder patch validation rejects {"quantity":"five"}
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
criticalRules.js:75:46
 const isValidAutoReorderPatch = ({ enabled, quantity, supplier }) => {
   if (enabled !== undefined && typeof enabled !== 'boolean') return false;
   if (quantity !== undefined) {
-    if (typeof quantity !== 'number') return false;
+    if (typeof quantity !== 'number') return true;
     if (!Number.isFinite(quantity)) return false;
   }
killedBy: critical payment, inventory, and authorization rules inventory auto-reorder patch validation rejects {"quantity":"five"}
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
criticalRules.js:75:9
 const isValidAutoReorderPatch = ({ enabled, quantity, supplier }) => {
   if (enabled !== undefined && typeof enabled !== 'boolean') return false;
   if (quantity !== undefined) {
-    if (typeof quantity !== 'number') return false;
+    if (typeof quantity === 'number') return false;
     if (!Number.isFinite(quantity)) return false;
   }
killedBy: critical payment, inventory, and authorization rules inventory auto-reorder patch validation accepts {"enabled":false,"quantity":0,"supplier":null}
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
criticalRules.js:76:9
   if (enabled !== undefined && typeof enabled !== 'boolean') return false;
   if (quantity !== undefined) {
     if (typeof quantity !== 'number') return false;
-    if (!Number.isFinite(quantity)) return false;
+    if (Number.isFinite(quantity)) return false;
   }
   if (supplier !== undefined && supplier !== null && typeof supplier !== 'string') return false;
killedBy: critical payment, inventory, and authorization rules inventory auto-reorder patch validation rejects {"quantity":null}
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
criticalRules.js:76:44
   if (enabled !== undefined && typeof enabled !== 'boolean') return false;
   if (quantity !== undefined) {
     if (typeof quantity !== 'number') return false;
-    if (!Number.isFinite(quantity)) return false;
+    if (!Number.isFinite(quantity)) return true;
   }
   if (supplier !== undefined && supplier !== null && typeof supplier !== 'string') return false;
killedBy: critical payment, inventory, and authorization rules inventory auto-reorder patch validation rejects {"quantity":null}
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
criticalRules.js:78:7
     if (typeof quantity !== 'number') return false;
     if (!Number.isFinite(quantity)) return false;
   }
-  if (supplier !== undefined && supplier !== null && typeof supplier !== 'string') return false;
+  if (supplier !== undefined && supplier !== null || typeof supplier !== 'string') return false;
   return true;
 };
killedBy: critical payment, inventory, and authorization rules inventory auto-reorder patch validation accepts {}
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
criticalRules.js:78:54
     if (typeof quantity !== 'number') return false;
     if (!Number.isFinite(quantity)) return false;
   }
-  if (supplier !== undefined && supplier !== null && typeof supplier !== 'string') return false;
+  if (supplier !== undefined && supplier !== null && typeof supplier === 'string') return false;
   return true;
 };
killedBy: critical payment, inventory, and authorization rules inventory auto-reorder patch validation rejects {"supplier":123}
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
criticalRules.js:79:10
     if (!Number.isFinite(quantity)) return false;
   }
   if (supplier !== undefined && supplier !== null && typeof supplier !== 'string') return false;
-  return true;
+  return false;
 };
 
killedBy: critical payment, inventory, and authorization rules inventory auto-reorder patch validation accepts {}
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
criticalRules.js:82:35
   return true;
 };
 
-const isSuspendedRole = (role) => role === 'suspended';
+const isSuspendedRole = (role) => role !== 'suspended';
 
 module.exports = {
killedBy: critical payment, inventory, and authorization rules authorization role validation only suspended role is blocked
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
